Repository: robot-xliff-farmer/mapsapi-examples
Catalog: mapsapi-examples.tmx
Source language: ru
Languages: en

source: Получаем центр карты в глобальных пиксельных координатах.
en: Getting the center of the map in global pixel coordinates.

source: Получением размер контейнера карты на странице.
en: Getting the size of the map container on the page.

source: Вычисляем границы карты в глобальных пиксельных координатах.
en: Calculating the map boundaries in global pixel coordinates.

source: Проверяем, что завершение работы драггера произошло в видимой области карты.
en: Checking that the dragger finished working in a visible area of the map.

source: Теперь переводим глобальные пиксельные координаты в геокоординаты с учетом текущего уровня масштабирования карты.
en: Now we'll convert the global pixel coordinates to geocoordinates with the current zoom level of the map.

source: Поле 'delta' содержит разницу между положениями текущего и предыдущего события драггера.
en: The 'delta' field contains the difference between the positions of the current and previous dragger events.

source: Создание метки с квадратной активной областью.
en: Creating a placemark with a square hotspot.

source: Описываем фигуру активной области "Прямоугольник".
en: Describing the shape of a "Rectangle" hotspot.

source: Прямоугольник описывается в виде двух точек - верхней левой и нижней правой.
en: The rectangle is defined as two points: the upper left and lower right.

source: Создание метки с круглой активной областью.
en: Creating a placemark with a round hotspot.

source: Описываем фигуру активной области "Круг".
en: Describing the shape of a "Circle" hotspot.

source: Круг описывается в виде центра и радиуса
en: The circle is defined as the center and radius

source: Создание метки со сложной фигурой активной области.
en: Creating a placemark with a complex hotspot shape.

source: Описываем фигуру активной области "Полигон".
en: Describing the shape of a "Polygon" hotspot.

source: Полигон описывается в виде трехмерного массива. Массив верхнего уровня содержит контуры полигона. Первый элемента массива - это внешний контур, а остальные - внутренние.
en: A polygon is defined as a three-dimensional array. The top-level array contains the contours of the polygon. The first element of the array is the external contour, and the others are internal contours.

source: Описание внешнего контура полигона в виде массива координат.
en: Describing the external polygon contour as an array of coordinates.

source: , ... Описание внутренних контуров - пустых областей внутри внешнего.
en: ... Describing the internal contours - empty areas inside the external contour.

source: Пример задания своих HTML макетов меток со своими фигурами активных областей
en: Example of setting custom HTML layouts for placemarks with your own hotspot shapes

source: Не отображаем на карте никакие стандартные элементы управления, так как они не были загружены.
en: Not displaying any standard controls on the map, as they were not loaded.

source: Если модуль уже был загружен, то нет необходимости повторно обращаться к модульной системе.
en: If the module has already been loaded, there is no need to access the module system again.

source: Загружаем по требованию класс метки и оверлея метки. По умолчанию оверлей автоматически загружается после добавления метки на карту. В данном примере происходит асинхронная загрузка самого модуля метки и нет необходимости в отдельной подгрузке оверлея.
en: On-demand loading of the placemarks class and overlay. By default, the overlay is automatically loaded after you add placemarks to the map. In this example, the placemark module itself is loaded asynchronously and there is no need to load the overlay separately.

source: Добавляем в глобальную область видимости класс вручную, так как при использовании метода require модульной системы этого не происходит.
en: Adding the class manually to the global viewport, since this does not happen when using the "require" method of the module system.

source: Устанавливаем случайную позицию, близкую к центру карты.
en: Setting a random position close to the center of the map.

source: При помощи GET параметра load можно перечислить необходимые модули API Яндекс.Карт.
en: Use the "load" GET parameter to list the necessary Yandex.Maps API modules.

source: Каждому географическому объекту в YMapsML ставятся в соответствие геометрическая фигура и геообъект, используемый для отображения этой фигуры на карте. Описание фигур и их привязка к географическим координатам задаются в соответствующих YMapsML-элементах. Для описания фигуры "точка" предназначен элемент gml:Point. Для отображения точки на карте используется геообъект Placemark.
en: In YMapsML, each geographical object is associated with a geometric shape and a geo object that is used for displaying this shape on the map. The shape definitions and their anchors to geographical coordinates are set in corresponding YMapsML elements. The gml:Point element is designated for the "point" shape. The Placemark geo object is used for displaying a point on the map.

source: Для загрузки YMapsML-данных предназначена функция [#$dp14]. После того как данные загрузятся, функция преобразует их в [#$dp15] и затем передает в качестве параметра функции-обработчику. Коллекцию геообъектов GeoObjectCollection можно отобразить на карте.
en: The [#$dp14] function is for loading YMapsML data. After data has loaded, the function converts the data to [#$dp15] and passes it to the handler function as a parameter. A GeoObjectCollection can be displayed on the map.

source: Примеры YMapsML. Добавление метки на карту.
en: YMapsML examples. Adding placemarks to the map.

source: После того как данные YmapsMl-файла загрузятся, вызывается callback-функция.
en: After the data from the YMapsML file loads, the callback function is called.

source: Добавляем коллекцию геообъектов на карту.
en: Adding a collection of geo objects to the map.

source: Примеры. Редактирование маршрута
en: Examples. Editing a route

source: Включить редактор маршрута
en: Enable the route editor

source: Признак начала редактирования маршрута.
en: Indicates the beginning of route editing.

source: Построение маршрута от станции метро Смоленская до станции Третьяковская. Маршрут должен проходить через метро "Арбатская".
en: Building a route from Smolenskaya metro station to Tretyakov station. The route should pass through Arbatskaya station.

source: Метро Арбатская - транзитная точка (проезжать через эту точку, но не останавливаться в ней).
en: Metro Arbatskaya is a through point (passing through this point, but not stopping at it).

source: Метро "Третьяковская".
en: Metro Tretyakovskaya.

source: Автоматически позиционировать карту.
en: Automatically positioning the map.

source: Включаем редактор.
en: Turning on the editor.

source: Выключаем редактор.
en: Turning off the editor.

source: API позволяет получить информацию о предполагаемом местоположении пользователя по IP-адресу.
en: The API lets you get information about the user's probable location by the IP address.

source: Доступ к этим данным предоставляет статический объект [#$dp11].
en: Access to this data is provided by the static [#$dp11] object.

source: Примеры. Определение местоположения пользователя
en: Examples. Detecting user location

source: Сравним положение, вычисленное по ip пользователя и положение, вычисленное средствами браузера.
en: Comparing the position calculated from the user's IP address and the position detected using the browser.

source: Красным цветом пометим положение, вычисленное через ip.
en: We'll mark the position calculated by IP in red.

source: Синим цветом пометим положение, полученное через браузер. Если браузер не поддерживает эту функциональность, метка не будет добавлена на карту.
en: We'll mark the position obtained through the browser in blue. If the browser does not support this functionality, the placemark will not be added to the map.

source: YMapsML - язык описания географических объектов.
en: YMapsML is a language for describing geographical objects.

source: Каждому географическому объекту в YMapsML ставятся в соответствие геометрическая фигура и геообъект, используемый для отображения этой фигуры на карте. Описание фигур и их привязка к географическим координатам задается в соответствующих YMapsML-элементах. Для фигуры "точка" предназначен элемент gml:Point.
en: In YMapsML, each geographical object is associated with a geometric shape and a geo object that is used for displaying this shape on the map. The shape definitions and their anchors to geographical coordinates are set in corresponding YMapsML elements. The gml:Point element is designated for the "point" shape.

source: Для загрузки YMapsML-данных предназначена функция [#$dp17]. После того как данные загрузятся, функция преобразует их в [#$dp18] и передает в качестве параметра функции-обработчику.
en: The [#$dp17] function is for loading YMapsML data. After data has loaded, the function converts the data to [#$dp18] and passes it to the handler function as a parameter.

source: Добавление элемента в список.
en: Adding an element to the list.

source: Показать/скрыть группу геообъектов на карте.
en: Showing/hiding a group of geo objects on the map.

source: Если пункт меню "неактивный", то добавляем группу на карту, иначе - удаляем с карты.
en: If the menu item is "inactive," we add the group to the map. Otherwise, we delete it from the map.

source: Меняем "активность" пункта меню.
en: Changing the "active" state of the menu item.

source: Добавление нового пункта меню в список.
en: Adding a new menu item to the list.

source: Примеры YMapsML. Создание меню для отображения групп объектов.
en: YMapsML examples. Creating a menu for displaying groups of objects.

source: Зададим массив, описывающий иконки кластеров разного размера.
en: Defining an array that describes cluster icons of different sizes.

source: Эта опция отвечает за размеры кластеров. В данном случае для кластеров, содержащих до 100 элементов, будет показываться маленькая иконка. Для остальных - большая.
en: This option is responsible for the cluster sizes. In this case, for clusters containing up to 100 elements, it will show a small icon. For the rest, a large icon will be shown.

source: Примеры. Собственные метки для кластеров
en: Examples. Custom placemarks for clusters

source: Примеры. Редактор многоугольника
en: Examples. Polygon editor

source: Кликните на карту, чтобы начать создание многоугольника
en: Click on the map to start creating a polygon

source: Создаем многоугольник без вершин.
en: Creating a polygon with no vertices.

source: Курсор в режиме добавления новых вершин.
en: The cursor in the mode for adding new vertices.

source: Максимально допустимое количество вершин.
en: The maximum number of vertices.

source: Цвет заливки.
en: Fill color.

source: В режиме добавления новых вершин меняем цвет обводки многоугольника.
en: In the mode for adding new vertices, we change the stroke color of the polygon.

source: Включаем режим редактирования с возможностью добавления новых вершин.
en: Turning on the edit mode with the possibility of adding new vertices.

source: Размер карты определяется при ее создании менеджером контейнеров. Далее карта не следит за возможными изменениями своих размеров. Чтобы карта изменила свои размеры на актуальные, требуется вызов функции менеджера fitToViewport().
en: Map size is determined when it is created by the container manager. After this, the map does not track possible changes to its size. In order for the map to change its size to the current size, call the fitToViewport() function.

source: Если скопировать полный код примера в новый HTML-документ, развернутая карта будет полностью занимать область просмотра браузера.
en: If you copy the full code of the example to a new HTML document, the opened map will take up the entire browser viewport.

source: При сложных перестроениях можно выставить автоматическое обновление карты при изменении размеров контейнера. При простых изменениях размера контейнера рекомендуется обновлять карту программно. autoFitToViewport: 'always'
en: For complex rebuilds, we can set automatic updates to the map when the container is resized. For simple changes to the size of the container, we recommend updating the map programmatically. autoFitToViewport: 'always'

source: Добавляем/убираем CSS-класс, определяющий размеры контейнера карты, заданные в абсолютных единицах (300x200 px).
en: Adding/removing a CSS class that defines the dimensions of the map container in absolute units (300x200 px).

source: Если выставлен флаг, сообщаем карте, что ей следует привести свои размеры к размерам контейнера.
en: If set, we tell the map that it should match its dimensions to the dimensions of the container.

source: Примеры. Изменение размеры карты.
en: Examples. Resizing the map

source: Развернуть/Cвернуть
en: Expand/Collapse

source: Изменить размеры карты
en: Resize the map

source: Информировать карту
en: Inform the map

source: Основным компонентом API является карта, которая может быть размещена в любом блочном HTML-элементе и всегда имеет прямоугольную форму.
en: The main component of the API is a map that can be placed in any block HTML element and always has a rectangular shape.

source: Для создания карты предназначен класс [#$dp8]. В конструкторе необходимо указать центр, коэффициент масштабирования и HTML-элемент, в котором будет размещена карта.
en: To create a map, use the [#$dp8] class. In the constructor, you must specify the center, the zoom factor, and the HTML element that will contain the map.

source: Примеры. Размещение карты на странице.
en: Examples. Putting the map on a page.

source: Удалить карту
en: Delete map

source: Дождёмся загрузки API и готовности DOM.
en: Waiting for the API to load and DOM to be ready.

source: Создание экземпляра карты и его привязка к контейнеру с заданным id ("map").
en: Creating an instance of the map and binding it to the container with the specified ID ("map").

source: При инициализации карты обязательно нужно указать её центр и коэффициент масштабирования.
en: When initializing the map, you must specify its center and the zoom factor.

source: Для уничтожения используется метод destroy.
en: To destroy it, the "destroy" method is used.

source: Подробнее о параметрах и опциях мультимаршрутизатора описано в примере Построение автомобильного мультимаршрута.
en: For more information about the multirouter parameters and options, see the example Building a driving multiroute.

source: routeMarkerIconContentLayout - чтобы показывать время для всех сегментов.
en: routeMarkerIconContentlayout - To show the time for all segments.

source: Примеры. Маршрут на общественном транспорте
en: Examples. Route on public transport

source: В функцию поступает пространство имен, которое содержит все запрощенные при инициализации модули.
en: The function receives the namespace that contains everything you've requested during initialization of modules.

source: В данном примере карта создается без контролов, так как те не были загружены при инициализации API.
en: In this example, the map is created without controls, because they were not loaded during API initialization.

source: При помощи GET параметра load можно перечислить только необходимые модули API Яндекс.Карт.
en: Use the "load" GET parameter to list the necessary Yandex.Maps API modules.

source: Примеры. События геообъекта
en: Examples. Geo object events

source: wayPoint - опции отображений путевых точек;
en: wayPoint - display options for waypoints.

source: wayPointStart - опции отображения начальной путевой точки;
en: wayPointStart - display options for the starting waypoint.

source: wayPointFinish - опции отображения конечной путевой точки;
en: wayPointFinish - display options for the destination waypoint.

source: viaPoint - опции отображений транзитных точек;
en: viaPoint - display options for thru points.

source: pin - опции отображений точечных маркеров в путевых точках;
en: pin - display options for point markers at waypoints.

source: route - опции отображений маршрутов;
en: route - display options for routes.

source: routeActive - опции отображения активного маршрута;
en: routeActive - display options for the active route.

source: editor - опции редактора мультимаршрута (см. [#$dp23]).
en: editor - options for the multiroute editor (see [#$dp23]).

source: Примеры. Настройка отображения мультимаршрута
en: Examples. Configuring the view of a multiroute

source: Объявляем набор опорных точек, и массив индексов транзитных точек.
en: Declaring a set of reference points and an array of throughpoint indexes.

source: Создаем мультимаршрут и настраиваем его внешний вид с помощью опций.
en: Creating a multiroute and using options to configure its appearance.

source: Внешний вид путевых точек.
en: Display options for waypoints.

source: Задаем собственную картинку для последней путевой точки.
en: Setting a custom image for the last waypoint.

source: Позволяет скрыть иконки путевых точек маршрута. wayPointVisible:false,
en: This allows hiding the icon for the route's waypoints. wayPointVisible:false,

source: Внешний вид транзитных точек.
en: Display options for throughpoints.

source: Транзитные точки можно перетаскивать, при этом маршрут будет перестраиваться.
en: Throughpoints can be dragged, and the route will adjust.

source: Позволяет скрыть иконки транзитных точек маршрута. viaPointVisible:false,
en: This allows hiding the icon for the route's throughpoints. viaPointVisible:false,

source: Внешний вид точечных маркеров под путевыми точками.
en: Display options for pin markers under waypoints.

source: Позволяет скрыть точечные маркеры путевых точек. pinVisible:false,
en: This allows hiding pin markers for waypoints. pinVisible:false,

source: Внешний вид линии маршрута.
en: Display options for the route line.

source: Настраиваем внешний вид второй точки через прямой доступ к ней.
en: Setting the display options for the second point by directly accessing it.

source: Создаем кнопку.
en: Creating a button.

source: Объявляем обработчики для кнопки.
en: Declaring handlers for the button.

source: Т.к. вторая точка была удалена, нужно заново ее настроить.
en: Since the second point was deleted, we have to set it up again.

source: Функция настройки внешнего вида второй точки.
en: Function for configuring the appearance of the second point.

source: Ждем пока будут загружены данные мультимаршрута и созданы отображения путевых точек.
en: Waiting for the multiroute data to load and the views of the waypoints to be created.

source: Создаем балун у метки второй точки.
en: Creating a balloon for the second waypoint's marker.

source: Основными параметрами карты являются область показа, область картографирования и тип карты.
en: The main parameters of the map are the viewport, mapping area, and map type.

source: При создании карты необходимо указать её центр и коэффициент масштабирования. В дальнейшем их можно изменить.
en: When creating a map, you must specify its center and zoom level. You can change them in the future.

source: Схема (yandex#map) — по умолчанию;
en: Scheme (yandex#map) - by default;

source: Спутник (yandex#satellite);
en: Satellite (yandex#satellite);

source: Гибрид (yandex#hybrid);
en: Hybrid (yandex#hybrid);

source: Народная карта (yandex#publicMap);
en: Public map (yandex#publicMap);

source: Гибрид народной карты (yandex#publicMapHybrid).
en: Public map hybrid (yandex#publicMapHybrid).

source: Тип карты реализуется в виде одного или нескольких наложенных друг на друга слоев. Существует возможность определения новых типов карт с помощью создания собственных слоев и/или комбинирования встроенных.
en: The map type is implemented as one or several layers superimposed on each other. It is possible to define new types of maps by creating your own layers and/or combining the pre-existing ones.

source: Примеры. Задание и изменение параметров карты.
en: Examples. Setting and changing the map settings.

source: Изменить центр
en: Change center

source: Изменить границы
en: Change boundaries

source: Изменить тип и плавно переместиться
en: Change the type and switch smoothly

source: Параметры карты можно задать в конструкторе.
en: Map parameters can be set in the constructor.

source: ID DOM-элемента, в который будет добавлена карта.
en: The ID of the DOM element that the map will be added to.

source: Параметры карты.
en: Map parameters.

source: Географические координаты центра отображаемой карты.
en: Geographical coordinates of the center of the displayed map.

source: Масштаб.
en: Scale.

source: Тип покрытия карты: "Спутник".
en: Type of map coverage: "Satellite".

source: Поиск по организациям.
en: Searching for organizations.

source: Bounds - границы видимой области карты. Задаются в географических координатах самой юго-восточной и самой северо-западной точек видимой области.
en: Bounds - the boundaries of the map viewport. Set as the geographical coordinates of the South-Easternmost and North-Westernmost points of the viewport.

source: Меняем тип карты на "Народный гибрид".
en: Changing the map type to "Public Hybrid".

source: Плавное перемещение центра карты в точку с новыми координатами.
en: Smoothly moving the center of the map to the point with the new coordinates.

source: Задержка между перемещениями.
en: The delay between movements.

source: YMapsML - язык описания географических данных. С помощью YMapsML можно настраивать внешний вид географических объектов, отображаемых на карте, а также задавать параметры самой карты.
en: YMapsML is a language for describing geographical data. You can use YMapsML to configure the appearance of geographical objects displayed on the map, as well as to set parameters for the map itself.

source: Для задания параметров карты используется YMapsML-элемент repr:View. С его помощью можно задать тип и область показа карты. В данном примере карте задается тип "спутник".
en: To set the map parameters, use the repr:View YMapsML element. You can use it to set the type and area for the map viewport. In this example, the map is set to the "satellite" type.

source: Для загрузки YMapsML-данных предназначена функция [#$dp12].
en: The [#$dp12] function is for loading YMapsML data.

source: Примеры YMapsML. Изменение типа карты.
en: YMapsML example. Changing the map type.

source: Создание карты.
en: Creating the map.

source: Изменение типа карты.
en: Changing the map type.

source: Выводим в цикле список всех геообъектов.
en: Outputting a list of all geo objects in the cycle.

source: Определяем по какой метке произошло событие.
en: Determining what placemark the event occurred on.

source: По умолчанию опции балуна balloonMaxWidth и balloonMaxHeight не установлены для кластеризатора, так как все стандартные макеты имеют определенные размеры.
en: By default, the balloon options balloonMaxWidth and balloonMaxHeight are not set for the clusterer, since all standard layouts have defined dimensions.

source: Устанавливаем собственный макет контента балуна.
en: Setting a custom layout for balloon content.

source: Примеры. Собственный макет контента балуна кластера.
en: Examples. Custom layout for cluster balloon content.

source: Создаем первый собственный модуль - макет своего контрола.
en: Creating our first custom module - a custom control layout.

source: Список зависимостей модуля. Эти модули будут загружены (если раньше не были) перед вызовом функции, которая определяет модуль.
en: The list of module dependencies. These modules will be loaded (if they have not yet been loaded) before calling the function that defines the module.
